import React from "react";

function About() {
  return (
    <div>
      <h2>ความเป็นมาร้านนี้</h2>
      <p>
        ร้าน-Ant-engine-garage เป็นร้านที่เปิดมานานกว่า3ปี มีอะไหล่ครบทุกยี่ห้อ
        มีเจ้าของร้านชื่อ สมพร ไทยประดิษฐ์
        ช่างมือฉมังชื่อ จันทร์บำเพ็ญ,อ๋อยประดิษฐ์พร
        ช่างฝึกหัดชื่อ น้องเเป๊ะมินิคูเป้
        ความเป็นมาร้านนี้คือ เด็กชายพรสมัยเด็กๆชอบการดูรถมากๆเเละเขาได้ดูหนังมากมายเเละได้ตกหลุมรัก BMW-320i เเละได้ไปดูรถตามสนามมากมาย
        เเละหลังจากนั้นเขาโตมาเรื่อยๆก็ได้จบการศึกษาที่ SBAC SAPHANMOD จบสาขา Iธีร์ ในระหว่างนั้นเขาก็ศึกษาเรื่องรถด้วย เเละได้ไปศึกษาที่มหาลัย
        ธรรมศาสตร์ คณะวิศวกรรมยานยนต์ เเละพอจบการศึกษาก็ได้ทำงานจนได้ทุนมาประมาณนึงบวกกับขอทุนคุณพ่อมาด้วย เลยเริ่มเปิดร้านชื่อว่า
        Ant-engine-garage เนื่องจากตอนเด็กก็ชอบมดเเดงด้วยเลยตั้งชื่อนี้ เเละด้วยฝีมือเขาที่เรียนมา ช่วงเเรกๆก็เป็นร้านซ่อมปกติเพราะทุนไม่สูง
        เขาซ่อมได้ดีมากจนลูกค้าจ้างไปซ่อมนู่นนี่นั่น จนทุนสูงขึ้นก็เริ่มซื้ออะไหล่มาเปลี่ยนเยอะขึ้นเรื่อยๆเเละทำเงินได้ดีมาก เเละมีช่างมาสมัครที่อู่นี้ก็คือ
        ช่าง อ๋อยประดิษฐ์พร เเละด้วยช่างคนนี้เป็นช่างมือฉมังเช่นกัน เลยทำงานอย่างลุล่วงไปเรื่อยๆ เเละช่างพรก็มีเงินที่จะซื้อBMW-320iที่เขารักได้เเล้ว
        หลังจากนั้นสองเดือนช่างพรกับช่างอ๋อยก็สนิทกันมาก เเละช่างพรก็เริ่มรวยขึ้นเรื่อยๆเเล้ว พอเวลาผ่านไปห้าเดือนผ่านไปก็มีช่างมากมายหลายตา
        เเต่พอทำไปเรื่อยๆก็ทยอยย้ายออกมากัน
      </p>
    </div>
  );
}

export default About;
